tests/integration/test_fp/foam_template/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2006                                 |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector>
2500
(
(0.30334069058168 0.0 0.0)
(0.30334069058504004 0.0 0.0)
(0.3033406905884 0.0 0.0)
(0.30334069059176 0.0 0.0)
(0.30334069059512003 0.0 0.0)
(0.30334069059848 0.0 0.0)
(0.30334069060184 0.0 0.0)
(0.3033406906052 0.0 0.0)
...
);

boundaryField 
{ 
    inlet
    {
        type    fixedValue;
        value   uniform (0.30334069058168 0.0 0.0);
    }
    outlet
    {
        type    zeroGradient;
    }
    frontAndBack
    {
        type    empty;
    }
} 


// ************************************************************************* //