tests/integration/test_fp/foam_template/0.org/Z
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2006                                 |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Z;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar>
2500(
0.05 
0.05 
0.05 
0.05 
0.05 
0.05 
0.05 
0.05 
0.05 
...
);

boundaryField 
{ 
    inlet
    {
        type    fixedValue;
        value   uniform 0.05;
    }
    outlet
    {
        type    zeroGradient;
    }
    frontAndBack
    {
        type    empty;
    }
} 


// ************************************************************************* //