tests/integration/test_fp/foam_template/0.org/yc
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2006                                 |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      PV;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar>
2500(
3.5689413262441846e-13 
5.870104881732554e-13 
8.171268437220923e-13 
1.0472431992709293e-12 
1.2773595548197662e-12 
1.5074759103686032e-12 
1.73759226591744e-12 
1.9677086214662767e-12 
2.197824977015114e-12 
...
);

boundaryField 
{ 
    inlet
    {
        type    fixedValue;
        value   uniform 3.5689413262441846e-13;
    }
    outlet
    {
        type    zeroGradient;
    }
    frontAndBack
    {
        type    empty;
    }
} 


// ************************************************************************* //