tests/integration/test_fp/foam_template/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// ************************************************************************* //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default             Gauss linear;
}

divSchemes
{
    default         none;

    div(phi,U)			Gauss linear;
    div(phi,Z)			Gauss limitedLinear 1;
    div(phi,yc)			Gauss limitedLinear 1;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear corrected;

}

interpolationSchemes
{
  default                 linear;
}

snGradSchemes
{
    default                 corrected;
}
